app/controllers/admin_controller.rb

  def members
    @admins = Admin.all.page(params[:page])
---
SELECT "admins".* FROM "admins" LIMIT $1 OFFSET $2  [["LIMIT", 7], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"